{
  "last_updated": "2025-05-06",
  "guidelines": [
    {
      "code": "ICH_M4QR2",
      "title": "Common Technical Document (CTD) Quality Module Revision",
      "category": "Quality",
      "ctd_section": "Module 2, Module 3",
      "introduced": "2021-11-15",
      "purpose": "To improve submission and assessment efficiency for pharmaceutical quality data, enhancing lifecycle management and regulatory convergence.",
      "used_for": "Structuring quality data in CTD for regulatory submissions, including complex products like biologics and advanced therapies.",
      "for_beginners": "This guideline helps you organize quality data in Modules 2 and 3 of the CTD, ensuring clarity in QTPP, control strategies, and manufacturing processes.",
      "sub_guidelines": [
        {
          "code": "ICH_M4Q",
          "title": "CTD Quality Module"
        },
        {
          "code": "ICH_M4",
          "title": "Common Technical Document"
        }
      ]
    },
    {
      "code": "ICH_Q9R1",
      "title": "Quality Risk Management",
      "category": "Quality",
      "ctd_section": "Module 3",
      "introduced": "2023-03-14",
      "purpose": "To provide principles and tools for quality risk management to ensure product quality during dossier preparation.",
      "used_for": "Applying risk-based approaches in manufacturing, regulatory processes, and dossier documentation.",
      "for_beginners": "Use this to identify and manage risks in dossier preparation, focusing on critical quality attributes for Module 3.",
      "sub_guidelines": []
    },
    {
      "code": "ICH_Q12",
      "title": "Technical and Regulatory Considerations for Pharmaceutical Product Lifecycle Management",
      "category": "Quality",
      "ctd_section": "Module 3",
      "introduced": "2023-08-14",
      "purpose": "To outline lifecycle management strategies for pharmaceutical products to ensure consistent quality.",
      "used_for": "Managing post-approval changes and lifecycle updates in dossiers.",
      "for_beginners": "This guideline helps you plan long-term quality management for drugs, useful for Module 3 updates.",
      "sub_guidelines": []
    },
    {
      "code": "ICH_Q13",
      "title": "Continuous Manufacturing of Drug Substances and Drug Products",
      "category": "Quality",
      "ctd_section": "Module 3",
      "introduced": "2023-01-19",
      "purpose": "To develop training materials for harmonized implementation of continuous manufacturing principles.",
      "used_for": "Documenting continuous manufacturing processes in dossiers, especially for biotech and small molecules.",
      "for_beginners": "Learn how to document continuous manufacturing in Module 3 for regulatory approval.",
      "sub_guidelines": []
    },
    {
      "code": "ICH_Q1Q5C",
      "title": "Stability Testing Guidelines",
      "category": "Quality",
      "ctd_section": "Module 3",
      "introduced": "2022-10-28",
      "purpose": "To streamline stability testing guidelines into a single, harmonized document addressing core principles and innovative tools.",
      "used_for": "Ensuring stability data is properly documented in Module 3 for drug substances and products.",
      "for_beginners": "This helps you include stability testing data in your dossier to prove product shelf-life.",
      "sub_guidelines": [
        {
          "code": "ICH_Q1A",
          "title": "Stability Testing of New Drug Substances and Products"
        },
        {
          "code": "ICH_Q5C",
          "title": "Stability Testing of Biotechnological/Biological Products"
        }
      ]
    },
    {
      "code": "ICH_Q2R2_Q14",
      "title": "Analytical Validation and Development",
      "category": "Quality",
      "ctd_section": "Module 3",
      "introduced": "2023-10-30",
      "purpose": "To revise analytical validation and development guidelines for improved regulatory submissions.",
      "used_for": "Validating analytical methods for quality assurance in dossier submissions.",
      "for_beginners": "Use this to ensure your analytical methods in Module 3 are robust and compliant.",
      "sub_guidelines": []
    },
    {
      "code": "ICH_Q6R1",
      "title": "Specifications for New Drug Substances and Products",
      "category": "Quality",
      "ctd_section": "Module 3",
      "introduced": "2024-06-25",
      "purpose": "To update specifications guidelines for harmonized, science-based approaches across various modalities.",
      "used_for": "Setting quality specifications for drugs in Module 3, including biologics and advanced therapies.",
      "for_beginners": "This helps you define quality standards for your drug in the dossier.",
      "sub_guidelines": []
    },
    {
      "code": "ICH_Q8_Q9_Q10",
      "title": "Quality by Design and Risk Management Implementation",
      "category": "Quality",
      "ctd_section": "Module 2, Module 3",
      "introduced": "Unknown",
      "purpose": "To provide guidance on implementing Quality by Design (QbD), Quality Risk Management (QRM), and Pharmaceutical Quality System (PQS) principles.",
      "used_for": "Applying QbD and risk management in dossier preparation and manufacturing processes.",
      "for_beginners": "Use this to integrate risk-based and quality-by-design approaches in Modules 2 and 3.",
      "sub_guidelines": [
        {
          "code": "ICH_Q8",
          "title": "Pharmaceutical Development"
        },
        {
          "code": "ICH_Q9",
          "title": "Quality Risk Management"
        },
        {
          "code": "ICH_Q10",
          "title": "Pharmaceutical Quality System"
        }
      ]
    }
  ]
}